{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Relaciones"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [],
   "source": [
    "#conexiones a aura\n",
    "from neo4j import GraphDatabase\n",
    "uri = \"neo4j+ssc://1e48c053.databases.neo4j.io\"\n",
    "auth= (\"neo4j\", \"R_ro7G4XS1ixvmtnxHX5_Kb0pXxZ_Lohg91TPLoaHZQ\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "#un solo label\n",
    "def crear_nodo(uri, auth, label, propiedades):\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        resultado = session.run(f\"CREATE (n:{label} $props) RETURN n\", props=propiedades)\n",
    "        nodo = resultado.single()[0]\n",
    "    driver.close()\n",
    "    return nodo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "#2 o más labels\n",
    "def crear_nodo_con_labels(uri, auth, labels, propiedades):\n",
    "    # Conecta a la base de datos\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        labels_str = \":\" + \":\".join(labels)\n",
    "        query = f\"CREATE (n{labels_str} $props) RETURN n\"\n",
    "        resultado = session.run(query, props=propiedades)\n",
    "        nodo = resultado.single()[0]\n",
    "    driver.close()\n",
    "    return nodo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "def consultar_nodos(uri, auth, label=None, filtros=None, solo_uno=False):\n",
    "    \"\"\"\n",
    "    :param label: Label del nodo (opcional). Si no se especifica, buscará nodos sin filtrar por label.\n",
    "    :param filtros: Diccionario con propiedades para filtrar. Ej: {\"nombre\": \"Juan\", \"edad\": 30}\n",
    "    :param solo_uno: Si es True, retorna solo el primer nodo que coincida con los filtros. \n",
    "                     Si es False, retorna todos los nodos que coincidan\n",
    "    \"\"\"\n",
    "    \n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        # Construimos la parte inicial del query: MATCH (n:Label)\n",
    "        query = \"MATCH (n\"\n",
    "        if label:\n",
    "            query += f\":{label}\"\n",
    "        query += \")\"\n",
    "        \n",
    "        # Si se especifican filtros, creamos condiciones en el WHERE\n",
    "        if filtros:\n",
    "            condiciones = []\n",
    "            for key in filtros.keys():\n",
    "                # Genera algo como \"n.nombre = $props.nombre\"\n",
    "                condiciones.append(f\"n.{key} = $props.{key}\")\n",
    "            query += \" WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        # Decidimos si queremos un único nodo o todos\n",
    "        if solo_uno:\n",
    "            query += \" RETURN n LIMIT 1\"\n",
    "        else:\n",
    "            query += \" RETURN n\"\n",
    "        \n",
    "        # Ejecutamos el query, pasando las propiedades en 'props'\n",
    "        resultado = session.run(query, props=filtros)\n",
    "        \n",
    "        if solo_uno:\n",
    "            # Retornamos el primer nodo si existe\n",
    "            registro = resultado.single()\n",
    "            if registro:\n",
    "                return registro[\"n\"]\n",
    "            else:\n",
    "                return None\n",
    "        else:\n",
    "            # Retornamos una lista de todos los nodos encontrados\n",
    "            nodos = []\n",
    "            for registro in resultado:\n",
    "                nodos.append(registro[\"n\"])\n",
    "            return nodos\n",
    "    \n",
    "    driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "def agregar_propiedades_nodo_por_filtro(uri, auth, label, filtros, propiedades):\n",
    "    \"\"\"\n",
    "    Agrega (o sobrescribe) propiedades en un único nodo que cumpla con el filtro.\n",
    "    Si el filtro coincide con varios, solo se actualiza el primero.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        # Construir la cláusula WHERE directamente si se proporcionan filtros\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        SET n += $props\n",
    "        RETURN n\n",
    "        LIMIT 1\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, props=propiedades)\n",
    "        registro = resultado.single()\n",
    "        driver.close()\n",
    "        return registro[\"n\"] if registro else None\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "def agregar_propiedades_nodos_por_filtro(uri, auth, label, filtros, propiedades):\n",
    "    \"\"\"\n",
    "    Agrega (o sobrescribe) propiedades a todos los nodos que cumplan con el filtro.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        SET n += $props\n",
    "        RETURN n\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, props=propiedades)\n",
    "        nodos = [registro[\"n\"] for registro in resultado]\n",
    "        driver.close()\n",
    "        return nodos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [],
   "source": [
    "def actualizar_propiedades_nodo_por_filtro(uri, auth, label, filtros, propiedades):\n",
    "    \"\"\"\n",
    "    Actualiza (o agrega) propiedades en un único nodo que cumpla con el filtro.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        SET n += $props\n",
    "        RETURN n\n",
    "        LIMIT 1\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, props=propiedades)\n",
    "        registro = resultado.single()\n",
    "        driver.close()\n",
    "        return registro[\"n\"] if registro else None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "def actualizar_propiedades_nodos_por_filtro(uri, auth, label, filtros, propiedades):\n",
    "    \"\"\"\n",
    "    Actualiza (o agrega) propiedades en todos los nodos que cumplan con el filtro.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        SET n += $props\n",
    "        RETURN n\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, props=propiedades)\n",
    "        nodos = [registro[\"n\"] for registro in resultado]\n",
    "        driver.close()\n",
    "        return nodos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_propiedades_nodo_por_filtro(uri, auth, label, filtros, lista_propiedades):\n",
    "    \"\"\"\n",
    "    Elimina propiedades específicas de un único nodo que cumpla con el filtro.\n",
    "    Si el filtro coincide con varios, solo se elimina de uno.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        FOREACH (key IN $keys | REMOVE n[key])\n",
    "        RETURN n\n",
    "        LIMIT 1\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, keys=lista_propiedades)\n",
    "        registro = resultado.single()\n",
    "        driver.close()\n",
    "        return registro[\"n\"] if registro else None\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_propiedades_nodos_por_filtro(uri, auth, label, filtros, lista_propiedades):\n",
    "    \"\"\"\n",
    "    Elimina propiedades específicas de todos los nodos que cumplan con el filtro.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        FOREACH (key IN $keys | REMOVE n[key])\n",
    "        RETURN n\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros, keys=lista_propiedades)\n",
    "        nodos = [registro[\"n\"] for registro in resultado]\n",
    "        driver.close()\n",
    "        return nodos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "def crear_relacion_con_propiedades_por_filtro(\n",
    "    uri, auth,\n",
    "    label_a, filtros_a,\n",
    "    label_b, filtros_b,\n",
    "    tipo_relacion,\n",
    "    propiedades_relacion\n",
    "):\n",
    "    \"\"\"\n",
    "    Crea una relación con un tipo y propiedades entre dos nodos existentes \n",
    "    buscados por filtros (en lugar de usar IDs internos).\n",
    "\n",
    "    :param label_a: Label del primer nodo (p.ej. \"Persona\")\n",
    "    :param filtros_a: Diccionario de propiedades para filtrar el primer nodo (p.ej. {\"uuid\": \"abc123\"})\n",
    "    :param label_b: Label del segundo nodo (p.ej. \"Persona\")\n",
    "    :param filtros_b: Diccionario de propiedades para filtrar el segundo nodo (p.ej. {\"uuid\": \"xyz789\"})\n",
    "    :param tipo_relacion: Tipo de la relación (p.ej. \"AMIGO_DE\", \"CONOCE_A\", etc.)\n",
    "    :param propiedades_relacion: Diccionario con **al menos 3** propiedades para la relación\n",
    "    :return: El objeto de relación creado (neo4j.graph.Relationship) o None si no se encontró ningún par de nodos\n",
    "    \"\"\"\n",
    "\n",
    "    # Verificamos que la relación tenga al menos 3 propiedades\n",
    "    if len(propiedades_relacion) < 3:\n",
    "        raise ValueError(\"Se requieren al menos 3 propiedades para la relación.\")\n",
    "\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        # Construimos la cláusula WHERE para cada nodo en función de los filtros\n",
    "        where_clause_a = \"\"\n",
    "        if filtros_a:\n",
    "            condiciones_a = [f\"a.{k} = $filtrosA.{k}\" for k in filtros_a]\n",
    "            where_clause_a = \" AND \".join(condiciones_a)\n",
    "        \n",
    "        where_clause_b = \"\"\n",
    "        if filtros_b:\n",
    "            condiciones_b = [f\"b.{k} = $filtrosB.{k}\" for k in filtros_b]\n",
    "            where_clause_b = \" AND \".join(condiciones_b)\n",
    "        \n",
    "        # Unimos las condiciones en un WHERE final (si existen)\n",
    "        if where_clause_a and where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_a} AND {where_clause_b}\"\n",
    "        elif where_clause_a:\n",
    "            final_where = f\"WHERE {where_clause_a}\"\n",
    "        elif where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_b}\"\n",
    "        else:\n",
    "            final_where = \"\"\n",
    "\n",
    "        # Creamos el query\n",
    "        query = f\"\"\"\n",
    "        MATCH (a:{label_a}), (b:{label_b})\n",
    "        {final_where}\n",
    "        CREATE (a)-[r:{tipo_relacion} $relProps]->(b)\n",
    "        RETURN r\n",
    "        \"\"\"\n",
    "\n",
    "        # Ejecutamos el query\n",
    "        result = session.run(\n",
    "            query,\n",
    "            filtrosA=filtros_a,\n",
    "            filtrosB=filtros_b,\n",
    "            relProps=propiedades_relacion\n",
    "        )\n",
    "        \n",
    "        # Obtenemos la primera relación creada (o None si no se creó ninguna)\n",
    "        record = result.single()\n",
    "        relacion_creada = record[\"r\"] if record else None\n",
    "\n",
    "    driver.close()\n",
    "    return relacion_creada"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_un_nodo_por_filtro(uri, auth, label, filtros):\n",
    "    \"\"\"\n",
    "    Elimina un único nodo que cumpla con el filtro, junto con sus relaciones.\n",
    "    Retorna True si se eliminó el nodo, False si no se encontró ninguno.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        # Construcción dinámica del WHERE\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n:{label})\n",
    "        {where_clause}\n",
    "        WITH n LIMIT 1\n",
    "        DETACH DELETE n\n",
    "        RETURN count(n) AS nodosEliminados\n",
    "        \"\"\"\n",
    "        resultado = session.run(query, filtros=filtros)\n",
    "        record = resultado.single()\n",
    "        nodos_eliminados = record[\"nodosEliminados\"] if record else 0\n",
    "        \n",
    "    driver.close()\n",
    "    return nodos_eliminados > 0\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_multiples_nodos_por_labels_y_filtros(uri, auth, labels, filtros):\n",
    "    \"\"\"\n",
    "    Elimina todos los nodos que tengan todos los labels en `labels`\n",
    "    y que cumplan con las propiedades de `filtros`. También elimina \n",
    "    sus relaciones (DETACH). Retorna la cantidad de nodos eliminados.\n",
    "    \n",
    "    :param labels: Lista de labels (p.ej. [\"Persona\", \"Empleado\"]).\n",
    "                   El nodo debe tener todas esas labels.\n",
    "    :param filtros: Diccionario de propiedades para filtrar (p.ej. {\"edad\": 30}).\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        # Construir la parte de los labels, p.ej. :Persona:Empleado\n",
    "        labels_str = \":\" + \":\".join(labels)  # [\"Persona\", \"Empleado\"] -> \":Persona:Empleado\"\n",
    "\n",
    "        # Construir la cláusula WHERE con las propiedades del diccionario\n",
    "        where_clause = \"\"\n",
    "        if filtros:\n",
    "            condiciones = [f\"n.{key} = $filtros.{key}\" for key in filtros]\n",
    "            where_clause = \"WHERE \" + \" AND \".join(condiciones)\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (n{labels_str})\n",
    "        {where_clause}\n",
    "        DETACH DELETE n\n",
    "        RETURN count(n) AS nodosEliminados\n",
    "        \"\"\"\n",
    "        \n",
    "        resultado = session.run(query, filtros=filtros)\n",
    "        record = resultado.single()\n",
    "        nodos_eliminados = record[\"nodosEliminados\"] if record else 0\n",
    "\n",
    "    driver.close()\n",
    "    return nodos_eliminados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_una_relacion_por_filtro(\n",
    "    uri, auth,\n",
    "    label_a, filtros_a,\n",
    "    tipo_relacion,\n",
    "    label_b, filtros_b\n",
    "):\n",
    "    \"\"\"\n",
    "    Elimina una sola relación (la primera que coincida) entre dos nodos que cumplan los filtros.\n",
    "    Retorna True si se eliminó alguna relación, False si no se encontró ninguna.\n",
    "    \n",
    "    - label_a, filtros_a: para identificar el nodo de origen\n",
    "    - tipo_relacion: el tipo de la relación (ej: \"AMIGO_DE\")\n",
    "    - label_b, filtros_b: para identificar el nodo de destino\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause_a = \"\"\n",
    "        if filtros_a:\n",
    "            condiciones_a = [f\"a.{k} = $filtrosA.{k}\" for k in filtros_a]\n",
    "            where_clause_a = \" AND \".join(condiciones_a)\n",
    "        \n",
    "        where_clause_b = \"\"\n",
    "        if filtros_b:\n",
    "            condiciones_b = [f\"b.{k} = $filtrosB.{k}\" for k in filtros_b]\n",
    "            where_clause_b = \" AND \".join(condiciones_b)\n",
    "\n",
    "        # Unir condiciones en un único WHERE (si existen)\n",
    "        if where_clause_a and where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_a} AND {where_clause_b}\"\n",
    "        elif where_clause_a:\n",
    "            final_where = f\"WHERE {where_clause_a}\"\n",
    "        elif where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_b}\"\n",
    "        else:\n",
    "            final_where = \"\"\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (a:{label_a})-[r:{tipo_relacion}]->(b:{label_b})\n",
    "        {final_where}\n",
    "        WITH r LIMIT 1\n",
    "        DELETE r\n",
    "        RETURN count(r) AS relacionesEliminadas\n",
    "        \"\"\"\n",
    "        resultado = session.run(\n",
    "            query,\n",
    "            filtrosA=filtros_a,\n",
    "            filtrosB=filtros_b\n",
    "        )\n",
    "        record = resultado.single()\n",
    "        relaciones_eliminadas = record[\"relacionesEliminadas\"] if record else 0\n",
    "\n",
    "    driver.close()\n",
    "    return relaciones_eliminadas > 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_multiples_relaciones_por_filtro(\n",
    "    uri, auth,\n",
    "    label_a, filtros_a,\n",
    "    tipo_relacion,\n",
    "    label_b, filtros_b\n",
    "):\n",
    "    \"\"\"\n",
    "    Elimina todas las relaciones que coincidan entre nodos que cumplan los filtros.\n",
    "    Retorna la cantidad de relaciones eliminadas.\n",
    "    \"\"\"\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    with driver.session() as session:\n",
    "        where_clause_a = \"\"\n",
    "        if filtros_a:\n",
    "            condiciones_a = [f\"a.{k} = $filtrosA.{k}\" for k in filtros_a]\n",
    "            where_clause_a = \" AND \".join(condiciones_a)\n",
    "        \n",
    "        where_clause_b = \"\"\n",
    "        if filtros_b:\n",
    "            condiciones_b = [f\"b.{k} = $filtrosB.{k}\" for k in filtros_b]\n",
    "            where_clause_b = \" AND \".join(condiciones_b)\n",
    "\n",
    "        if where_clause_a and where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_a} AND {where_clause_b}\"\n",
    "        elif where_clause_a:\n",
    "            final_where = f\"WHERE {where_clause_a}\"\n",
    "        elif where_clause_b:\n",
    "            final_where = f\"WHERE {where_clause_b}\"\n",
    "        else:\n",
    "            final_where = \"\"\n",
    "        \n",
    "        query = f\"\"\"\n",
    "        MATCH (a:{label_a})-[r:{tipo_relacion}]->(b:{label_b})\n",
    "        {final_where}\n",
    "        DELETE r\n",
    "        RETURN count(r) AS relacionesEliminadas\n",
    "        \"\"\"\n",
    "        resultado = session.run(\n",
    "            query,\n",
    "            filtrosA=filtros_a,\n",
    "            filtrosB=filtros_b\n",
    "        )\n",
    "        record = resultado.single()\n",
    "        relaciones_eliminadas = record[\"relacionesEliminadas\"] if record else 0\n",
    "\n",
    "    driver.close()\n",
    "    return relaciones_eliminadas\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "def primer_menu():\n",
    "    print(\"¿Qué desea realizar?\")\n",
    "    print(\"1. Crear un nodo\")\n",
    "    print(\"2. Vizualizar nodos\")\n",
    "    print(\"3. Operaciones con nodos\")\n",
    "    print(\"4. Crear relaciones\")\n",
    "    print(\"5. Gestión de relaciones\")\n",
    "    print(\"6. Eliminar nodos\")\n",
    "    print(\"7. Eliminar relaciones\")\n",
    "    print(\"8. Salir\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_nodos():\n",
    "    print(\"¿Qué desesa realizar?\")\n",
    "    print(\"1. Creación de nodos con 1 label\")\n",
    "    print(\"2. Creación de nodos con 2 o más lables\")\n",
    "    res2 = input(\"Elija una opción (solo colocar el número de opción): \")\n",
    "\n",
    "    if res2 == \"1\":\n",
    "        print(\"Escriba el label del nodo que va a ingresar: \")\n",
    "        label = input(\"\")\n",
    "        preg1 = input(\"¿Quiere agreagr propiedades? (Y/N) \")\n",
    "        if preg1 == \"Y\":\n",
    "            n = int(input(\"¿Cuántas propiedades quiere agregar? \"))\n",
    "            propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "\n",
    "        else: \n",
    "            propiedades = {}\n",
    "\n",
    "        crear_nodo(uri, auth, label, propiedades)\n",
    "\n",
    "    elif res2 == \"2\":\n",
    "        n1 = int(input(\"¿Cuántos labels quiere ingresar? \"))\n",
    "        print(\"Escriba el nombre de los labeles del nodo que va a ingresar: \")\n",
    "        labels = [input(\"Escriba el label \") for i in range(n1)]\n",
    "        preg1 = input(\"¿Quiere agreagr propiedades? (Y/N) \")\n",
    "        if preg1 == \"Y\":\n",
    "            n = int(input(\"¿Cuántas propiedades quiere agregar? \"))\n",
    "            propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "\n",
    "        else: \n",
    "            propiedades = {}\n",
    "\n",
    "        crear_nodo_con_labels(uri, auth, labels, propiedades)\n",
    "        \n",
    "    else:\n",
    "        print(\"Escriba una opción válida\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_consulta_nodos():\n",
    "    res3 = input(\"¿Desea buscar por label? (Y/N) \").upper()\n",
    "    res4 = input(\"¿Desea agregar filtros? (Y/N) \").upper()\n",
    "    nodo = input(\"¿Desea consultar un nodo o todos los nodos (uno/varios)? \").lower()\n",
    "    \n",
    "    if res3 == \"Y\" and res4 == \"Y\" and nodo == \"uno\":\n",
    "        label = input(\"Ingrese el label que quiere buscar: \")\n",
    "        filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        resultado = consultar_nodos(uri, auth, label, filtros, True)\n",
    "        print(\"Resultado:\", resultado)\n",
    "\n",
    "    elif res3 == \"Y\" and res4 == \"Y\" and nodo == \"varios\":\n",
    "        label = input(\"Ingrese el label que quiere buscar: \")\n",
    "        filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        resultado = consultar_nodos(uri, auth, label, filtros)\n",
    "        print(\"Resultados:\", resultado)\n",
    "\n",
    "    elif res3 == \"Y\" and res4 == \"N\" and nodo == \"uno\":\n",
    "        label = input(\"Ingrese el label que quiere buscar: \")\n",
    "        resultado = consultar_nodos(uri, auth, label, filtros=None, solo_uno=True)\n",
    "        print(\"Resultado:\", resultado)\n",
    "\n",
    "    elif res3 == \"Y\" and res4 == \"N\" and nodo == \"varios\":\n",
    "        label = input(\"Ingrese el label que quiere buscar: \")\n",
    "        resultado = consultar_nodos(uri, auth, label)\n",
    "        print(\"Resultados:\", resultado)\n",
    "\n",
    "    elif res3 == \"N\" and res4 == \"Y\" and nodo == \"uno\":\n",
    "        filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        resultado = consultar_nodos(uri, auth, label=None, filtros=filtros, solo_uno=True)\n",
    "        print(\"Resultado:\", resultado)\n",
    "\n",
    "    elif res3 == \"N\" and res4 == \"Y\" and nodo == \"varios\":\n",
    "        filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        resultado = consultar_nodos(uri, auth, label=None, filtros=filtros)\n",
    "        print(\"Resultados:\", resultado)\n",
    "\n",
    "    elif res3 == \"N\" and res4 == \"N\" and nodo == \"uno\":\n",
    "        resultado = consultar_nodos(uri, auth, label=None, filtros=None, solo_uno=True)\n",
    "        print(\"Resultado:\", resultado)\n",
    "\n",
    "    elif res3 == \"N\" and res4 == \"N\" and nodo == \"varios\":\n",
    "        resultado = consultar_nodos(uri, auth)\n",
    "        print(\"Resultados:\", resultado)\n",
    "            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_operaciones_nodos():\n",
    "    print(\"¿Qué desea realizar? \")\n",
    "    print(\"1. Agregar 1 o más propiedades a un nodo\")\n",
    "    print(\"2. Agregar 1 o más propiedades a múltiples nodos\")\n",
    "    print(\"3. Actualizar 1 o más propiedades de un nodo\")\n",
    "    print(\"4. Actualizar 1 o más propiedades de múltiples nodos\")\n",
    "    print(\"5. Eliminar 1 o más propiedades de un nodo\")\n",
    "    print(\"6. Eliminar 1 o más propiedades de múltiples nodos\")\n",
    "\n",
    "    res5 = input(\"Escoge un número: \")\n",
    "    if res5 == \"1\":\n",
    "        nodo = input(\"Escribe el nombre del nodo al que le quieres agregar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "            \n",
    "        n = int(input(\"¿Cuántas propiedades quiere agregar?\"))\n",
    "        propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "        \n",
    "        agregar_propiedades_nodo_por_filtro(uri, auth, nodo, filtros, propiedades)\n",
    "\n",
    "    elif res5 == \"2\":\n",
    "        nodos = input(\"Escribe el nombre del nodo al que le quieres agregar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        else:\n",
    "            filtros = {}\n",
    "            \n",
    "        n = int(input(\"¿Cuántas propiedades quiere agregar?\"))\n",
    "        propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "        \n",
    "        agregar_propiedades_nodos_por_filtro(uri, auth, nodos, filtros, propiedades)\n",
    "\n",
    "    elif res5 == \"3\":\n",
    "        nodo = input(\"Escribe el nombre del nodo al que le quieres actualizar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "            \n",
    "        n = int(input(\"¿Cuántas propiedades quiere actualizar?\"))\n",
    "        propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "\n",
    "        actualizar_propiedades_nodo_por_filtro(uri, auth, nodo, filtros, propiedades)\n",
    "\n",
    "    elif res5 == \"4\":\n",
    "        nodo = input(\"Escribe el nombre del nodo al que le quieres actualizar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "        \n",
    "        n = int(input(\"¿Cuántas propiedades quiere actualizar?\"))\n",
    "        propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "\n",
    "        actualizar_propiedades_nodos_por_filtro(uri, auth, nodo, filtros, propiedades)\n",
    "\n",
    "    elif res5 == \"5\":\n",
    "        nodo = input(\"Escribe el nombre del nodo al que le quieres eliminar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "            \n",
    "        n = int(input(\"¿Cuántas propiedades quiere eliminar?\"))\n",
    "        propiedades = [input(\"Propiedad: \") for i in range(n)]\n",
    "\n",
    "        eliminar_propiedades_nodo_por_filtro(uri, auth, nodo, filtros, propiedades)\n",
    "\n",
    "    elif res5 == \"6\":\n",
    "        nodo = input(\"Escribe el nombre del nodo al que le quieres eliminar propiedades: \")\n",
    "        preg_res = input(\"¿Desea buscar por filtro? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Agregue las propiedades y el valor para encontrar el nodo: \")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "        \n",
    "        n = int(input(\"¿Cuántas propiedades quiere eliminar?\"))\n",
    "        propiedades = [input(\"Propiedad: \") for i in range(n)]\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_crear_relaciones():\n",
    "    nodo1 = input(\"Ingrese el nombre del primer nodo: \")\n",
    "    res6 = input(\"¿Quiere filtrar este primer nodo? (Y/N) \").upper()\n",
    "    nodo2 = input(\"Ingrese el nombre del segundo nodo: \")\n",
    "    res7 = input(\"¿Quiere filtrar este segundo nodo? (Y/N) \").upper()\n",
    "    tipo_relacion = input(\"Ingrese el tipo de relación que quiere crear (mayúsculas): \").upper()\n",
    "    print(\"¿Cuántas propiedades quiere crear? (deben de ser al menos 3) \")\n",
    "    n = int(input(\"¿Cuántas propiedades quiere crear?\"))\n",
    "    propiedades = {input(\"Propiedad: \"): input(\"Valor: \") for i in range(n)}\n",
    "    \n",
    "    if res6 == \"Y\" and res7 == \"Y\":\n",
    "        print(\"Ingrese la propiedad y el valor para filtrar el primer nodo\")\n",
    "        filtro1 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        print(\"Ingrese la propiedad y el valor para filtrar el segundo nodo\")\n",
    "        filtro2 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        crear_relacion_con_propiedades_por_filtro(uri, auth, nodo1, filtro1, nodo2, filtro2, tipo_relacion, propiedades)\n",
    "\n",
    "    elif res6 == \"Y\" and res7 == \"N\":\n",
    "        print(\"Ingrese la propiedad y el valor para filtrar el primer nodo\")\n",
    "        filtro1 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        filtro2 = {}\n",
    "        crear_relacion_con_propiedades_por_filtro(uri, auth, nodo1, filtro1, nodo2, filtro2, tipo_relacion, propiedades)\n",
    "\n",
    "    elif res6 == \"N\" and res7 == \"Y\":\n",
    "        filtro1 = {}\n",
    "        print(\"Ingrese la propiedad y el valor para filtrar el segundo nodo\")\n",
    "        filtro2 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        crear_relacion_con_propiedades_por_filtro(uri, auth, nodo1, filtro1, nodo2, filtro2, tipo_relacion, propiedades)\n",
    "\n",
    "    elif res6 == \"N\" and res7 == \"N\":\n",
    "        filtro1 = {}\n",
    "        filtro2 = {}\n",
    "        crear_relacion_con_propiedades_por_filtro(uri, auth, nodo1, filtro1, nodo2, filtro2, tipo_relacion, propiedades)\n",
    "            \n",
    "    else:\n",
    "        print(\"No ingresaste una respuesta válida\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_eliminacion_nodos():\n",
    "    print(\"¿Qué desea realizar?\")\n",
    "    print(\"1. Eliminar un nodo\")\n",
    "    print(\"2. Eliminar más de un nodo\")\n",
    "    res8 = input(\"Ingrese el número de la opción: \")\n",
    "\n",
    "    if res8 == \"1\":\n",
    "        nodo = input(\"Ingrese el nombre del nodo que quiere eliminar\")\n",
    "        fil_preg = input(\"¿Quiere encontrar por filtro (Y/N)? \")\n",
    "        if fil_preg == \"Y\":\n",
    "            \n",
    "            print(\"Ingrese el filtro para encontrar el nodo a eliminar\")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "    \n",
    "            eliminar_un_nodo_por_filtro(uri, auth, nodo, filtros)\n",
    "            \n",
    "        else:\n",
    "            filtros = {}\n",
    "            eliminar_un_nodo_por_filtro(uri, auth, nodo, filtros)\n",
    "\n",
    "    elif res8 == \"2\":\n",
    "        n_nodos = int(input(\"¿Cuántos nodos desea eliminar? \"))\n",
    "        nodos = [input(\"Ingrese el nombre del nodo a eliminar: \") for i in range(n_nodos)]\n",
    "        fil_preg = input(\"¿Quiere encontrar por filtro (Y/N)? \")\n",
    "        if fil_preg == \"Y\":\n",
    "            print(\"Ingrese el filtro para encontrar el nodo a eliminar\")\n",
    "            filtros = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "            \n",
    "            eliminar_multiples_nodos_por_labels_y_filtros(uri, auth, nodos, filtros)\n",
    "\n",
    "        else:\n",
    "            filtros = {}\n",
    "            eliminar_multiples_nodos_por_labels_y_filtros(uri, auth, nodos, filtros)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "def menu_eliminacion_relaciones():\n",
    "    print(\"¿Qué desea realizar?\")\n",
    "    print(\"1. Eliminar una relación\")\n",
    "    print(\"2. Eliminar varias relaciones\")\n",
    "    res9 = input(\"Ingrese el número de la opción: \")\n",
    "\n",
    "    if res9 == \"1\":\n",
    "        nodo1 = input(\"Ingrese el nombre del primer nodo: \")\n",
    "        preg_res = input(\"Quiere filtrar? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Ingrese los datos para los filtros\")\n",
    "            filtro1 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        else:\n",
    "            filtro1 = {}\n",
    "            \n",
    "        nodo2 = input(\"Ingrese el nombre del segundo nodo: \")\n",
    "        preg_res = input(\"Quiere filtrar? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Ingrese los datos para el filtro del segundo nodo\")\n",
    "            filtro2 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtro2 = {}\n",
    "        tipo_relacion = input(\"Escribe el tipo de relacion que tiene: \").upper()\n",
    "\n",
    "        eliminar_una_relacion_por_filtro(uri, auth, nodo1, filtro1, tipo_relacion, nodo2, filtro2)\n",
    "\n",
    "    elif res9 == \"2\":\n",
    "\n",
    "        nodo1 = input(\"Ingrese el nombre del primer nodo: \")\n",
    "        preg_res = input(\"Quiere filtrar? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Ingrese los datos para los filtros\")\n",
    "            filtro1 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "        else:\n",
    "            filtro1 = {}\n",
    "            \n",
    "        nodo2 = input(\"Ingrese el nombre del segundo nodo: \")\n",
    "        preg_res = input(\"Quiere filtrar? (Y/N) \")\n",
    "        if preg_res == \"Y\":\n",
    "            print(\"Ingrese los datos para el filtro del segundo nodo\")\n",
    "            filtro2 = {input(\"Propiedad: \"): input(\"Valor: \")}\n",
    "\n",
    "        else:\n",
    "            filtro2 = {}\n",
    "        tipo_relacion = input(\"Escribe el tipo de relacion que tiene: \").upper()\n",
    "\n",
    "        eliminar_multiples_relaciones_por_filtro(uri, auth, nodo1, filtro1, tipo_relacion, nodo2, filtro2)\n",
    "\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [],
   "source": [
    "def main():\n",
    "    exit = False\n",
    "    while exit != True:\n",
    "        primer_menu()\n",
    "        res1 = input(\"Elija una opción (solo colocar número de opción): \")\n",
    "        if res1 == \"1\":\n",
    "            menu_nodos()\n",
    "\n",
    "        elif res1 == \"2\":\n",
    "            menu_consulta_nodos()\n",
    "\n",
    "        elif res1 == \"3\":\n",
    "            menu_operaciones_nodos()\n",
    "\n",
    "        elif res1 == \"4\":\n",
    "            menu_crear_relaciones()\n",
    "\n",
    "        elif res1 == \"5\": #gestión de relacion\n",
    "            pass #quitar el pass\n",
    "\n",
    "        elif res1 == \"6\": #\n",
    "            menu_eliminacion_nodos()\n",
    "\n",
    "        elif res1 == \"7\":\n",
    "            menu_eliminacion_relaciones()\n",
    "\n",
    "        elif res1 == \"8\":\n",
    "            exit = True\n",
    "\n",
    "        else:\n",
    "            print(\"Ingrese un número válido\")\n",
    "        \n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "¿Qué desea realizar?\n",
      "1. Crear un nodo\n",
      "2. Vizualizar nodos\n",
      "3. Operaciones con nodos\n",
      "4. Crear relaciones\n",
      "5. Gestión de relaciones\n",
      "6. Eliminar nodos\n",
      "7. Eliminar relaciones\n",
      "8. Salir\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Elija una opción (solo colocar número de opción):  2\n",
      "¿Desea buscar por label? (Y/N)  Y\n",
      "¿Desea agregar filtros? (Y/N)  Y\n",
      "¿Desea consultar un nodo o todos los nodos (uno/varios)?  varios\n",
      "Ingrese el label que quiere buscar:  Actor\n",
      "Propiedad:  Name\n",
      "Valor:  Steve Martin\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Resultados: [<Node element_id='4:06cb893f-12e2-4ae8-8349-8a2e0fcd7ad1:7' labels=frozenset({'Actor'}) properties={'Born_Date': 1953, 'ActorID': 24701, 'Gender': 2, 'Name': 'Steve Martin'}>]\n",
      "¿Qué desea realizar?\n",
      "1. Crear un nodo\n",
      "2. Vizualizar nodos\n",
      "3. Operaciones con nodos\n",
      "4. Crear relaciones\n",
      "5. Gestión de relaciones\n",
      "6. Eliminar nodos\n",
      "7. Eliminar relaciones\n",
      "8. Salir\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Elija una opción (solo colocar número de opción):  6\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "¿Qué desea realizar?\n",
      "1. Eliminar un nodo\n",
      "2. Eliminar más de un nodo\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Ingrese el número de la opción:  2\n",
      "¿Cuántos nodos desea eliminar?  2\n",
      "Ingrese el nombre del nodo a eliminar:  Prueba1\n",
      "Ingrese el nombre del nodo a eliminar:  Prueba2\n",
      "¿Quiere encontrar por filtro (Y/N)?  N\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "¿Qué desea realizar?\n",
      "1. Crear un nodo\n",
      "2. Vizualizar nodos\n",
      "3. Operaciones con nodos\n",
      "4. Crear relaciones\n",
      "5. Gestión de relaciones\n",
      "6. Eliminar nodos\n",
      "7. Eliminar relaciones\n",
      "8. Salir\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Elija una opción (solo colocar número de opción):  8\n"
     ]
    }
   ],
   "source": [
    "main()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Empieza lo anterior"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def crear_relaciones(uri, auth, relationship_type, properties_keys):\n",
    "\n",
    "    empty_properties = {key: \"\" if isinstance(key, str) else 0 for key in properties_keys} #cre\n",
    "\n",
    "    query = f\"\"\"\n",
    "    MATCH (a:Actor)-[r:{relationship_type}]->()\n",
    "    SET r += $empty_properties\n",
    "    RETURN COUNT(r) AS total_updated\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, empty_properties=empty_properties)\n",
    "            return result.single()[\"total_updated\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "crear_relaciones(uri, auth, )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def crear_nodo(uri, auth, label, properties_keys):\n",
    "\n",
    "    empty_properties = {key: \"\" if isinstance(key, str) else 0 for key in properties_keys}\n",
    "\n",
    "    query = f\"\"\"\n",
    "    CREATE (n:{label} $empty_properties)\n",
    "    RETURN n\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, empty_properties=empty_properties)\n",
    "            return result.single()[\"n\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Node element_id='4:e4d2ff4f-6a8b-4c6c-b02d-80359d5618b7:99430' labels=frozenset({'Actor'}) properties={'Name': ''}>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "propiedades = {\"Name\": \"Franco\"}\n",
    "crear_nodo(uri, auth, \"Actor\", propiedades)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def crear_nodo_con_propiedades(uri, auth, label, properties):\n",
    "\n",
    "    query = f\"\"\"\n",
    "    CREATE (n:{label} $properties)\n",
    "    RETURN n\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, properties=properties)\n",
    "            return result.single()[\"n\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch for parameter 'properties': expected Map, Node or Relationship but was String (line 2, column 21 (offset: 21))\n\"    CREATE (n:Actor $properties)\"\n                     ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mGqlError\u001b[39m                                  Traceback (most recent call last)",
      "\u001b[31mGqlError\u001b[39m: {gql_status: 22N27} {gql_status_description: error: data exception - invalid entity type. Invalid input 'String' for  parameter: properties. Expected to be Map, Node or Relationship.} {message: 22N27: Invalid input 'String' for  parameter: properties. Expected to be Map, Node or Relationship.} {diagnostic_record: {'_classification': 'CLIENT_ERROR', '_position': {'column': 21, 'line': 2, 'offset': 21}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}} {raw_classification: CLIENT_ERROR}",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[31mCypherSyntaxError\u001b[39m                         Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[10]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m \u001b[43mcrear_nodo_con_propiedades\u001b[49m\u001b[43m(\u001b[49m\u001b[43muri\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mauth\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mActor\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mFranco\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[7]\u001b[39m\u001b[32m, line 10\u001b[39m, in \u001b[36mcrear_nodo_con_propiedades\u001b[39m\u001b[34m(uri, auth, label, properties)\u001b[39m\n\u001b[32m      8\u001b[39m \u001b[38;5;28;01mwith\u001b[39;00m GraphDatabase.driver(uri, auth=auth) \u001b[38;5;28;01mas\u001b[39;00m driver:\n\u001b[32m      9\u001b[39m     \u001b[38;5;28;01mwith\u001b[39;00m driver.session() \u001b[38;5;28;01mas\u001b[39;00m session:\n\u001b[32m---> \u001b[39m\u001b[32m10\u001b[39m         result = \u001b[43msession\u001b[49m\u001b[43m.\u001b[49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mproperties\u001b[49m\u001b[43m=\u001b[49m\u001b[43mproperties\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m     11\u001b[39m         \u001b[38;5;28;01mreturn\u001b[39;00m result.single()[\u001b[33m\"\u001b[39m\u001b[33mn\u001b[39m\u001b[33m\"\u001b[39m]\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/work/session.py:328\u001b[39m, in \u001b[36mSession.run\u001b[39m\u001b[34m(self, query, parameters, **kwargs)\u001b[39m\n\u001b[32m    326\u001b[39m bookmarks = \u001b[38;5;28mself\u001b[39m._get_bookmarks()\n\u001b[32m    327\u001b[39m parameters = \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, **kwargs)\n\u001b[32m--> \u001b[39m\u001b[32m328\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_auto_result\u001b[49m\u001b[43m.\u001b[49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m    329\u001b[39m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    330\u001b[39m \u001b[43m    \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    331\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    332\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    333\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    334\u001b[39m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    335\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    336\u001b[39m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_config\u001b[49m\u001b[43m.\u001b[49m\u001b[43mnotifications_disabled_classifications\u001b[49m\u001b[43m,\u001b[49m\n\u001b[32m    337\u001b[39m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    339\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m._auto_result\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/work/result.py:236\u001b[39m, in \u001b[36mResult._run\u001b[39m\u001b[34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[39m\n\u001b[32m    234\u001b[39m \u001b[38;5;28mself\u001b[39m._pull()\n\u001b[32m    235\u001b[39m \u001b[38;5;28mself\u001b[39m._connection.send_all()\n\u001b[32m--> \u001b[39m\u001b[32m236\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/work/result.py:430\u001b[39m, in \u001b[36mResult._attach\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    428\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m    429\u001b[39m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m._attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m430\u001b[39m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_connection\u001b[49m\u001b[43m.\u001b[49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/io/_common.py:184\u001b[39m, in \u001b[36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[39m\u001b[34m(*args, **kwargs)\u001b[39m\n\u001b[32m    182\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34minner\u001b[39m(*args, **kwargs):\n\u001b[32m    183\u001b[39m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m184\u001b[39m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[43m*\u001b[49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m*\u001b[49m\u001b[43m*\u001b[49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    185\u001b[39m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[32m    186\u001b[39m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio.iscoroutinefunction(\u001b[38;5;28mself\u001b[39m.__on_error)\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/io/_bolt.py:864\u001b[39m, in \u001b[36mBolt.fetch_message\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m    860\u001b[39m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[32m    861\u001b[39m tag, fields = \u001b[38;5;28mself\u001b[39m.inbox.pop(\n\u001b[32m    862\u001b[39m     hydration_hooks=\u001b[38;5;28mself\u001b[39m.responses[\u001b[32m0\u001b[39m].hydration_hooks\n\u001b[32m    863\u001b[39m )\n\u001b[32m--> \u001b[39m\u001b[32m864\u001b[39m res = \u001b[38;5;28;43mself\u001b[39;49m\u001b[43m.\u001b[49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m    865\u001b[39m \u001b[38;5;28mself\u001b[39m.idle_since = monotonic()\n\u001b[32m    866\u001b[39m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/io/_bolt5.py:1208\u001b[39m, in \u001b[36mBolt5x7._process_message\u001b[39m\u001b[34m(self, tag, fields)\u001b[39m\n\u001b[32m   1206\u001b[39m \u001b[38;5;28mself\u001b[39m._enrich_error_diagnostic_record(summary_metadata)\n\u001b[32m   1207\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m-> \u001b[39m\u001b[32m1208\u001b[39m     \u001b[43mresponse\u001b[49m\u001b[43m.\u001b[49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[32m   1209\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[32m   1210\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m.pool:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages/neo4j/_sync/io/_common.py:254\u001b[39m, in \u001b[36mResponse.on_failure\u001b[39m\u001b[34m(self, metadata)\u001b[39m\n\u001b[32m    252\u001b[39m handler = \u001b[38;5;28mself\u001b[39m.handlers.get(\u001b[33m\"\u001b[39m\u001b[33mon_summary\u001b[39m\u001b[33m\"\u001b[39m)\n\u001b[32m    253\u001b[39m Util.callback(handler)\n\u001b[32m--> \u001b[39m\u001b[32m254\u001b[39m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m._hydrate_error(metadata)\n",
      "\u001b[31mCypherSyntaxError\u001b[39m: {code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch for parameter 'properties': expected Map, Node or Relationship but was String (line 2, column 21 (offset: 21))\n\"    CREATE (n:Actor $properties)\"\n                     ^}"
     ]
    }
   ],
   "source": [
    "crear_nodo_con_propiedades(uri, auth, \"Actor\", \"Franco\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "def ver_nodos(uri, auth, label):\n",
    "    query = f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN n\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query)\n",
    "            return [record[\"n\"] for record in result]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "def borrar_un_nodo(uri, auth, node_id):\n",
    "\n",
    "    query = \"\"\"\n",
    "    MATCH (n)\n",
    "    WHERE ID(n) = $node_id\n",
    "    DETACH DELETE n\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            session.run(query, node_id=node_id)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "def borrar_varios_nodos(uri, auth, label, limit):\n",
    "\n",
    "    query = f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    WITH n LIMIT $limit\n",
    "    DETACH DELETE n\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, limit=limit)\n",
    "            return result.consume().counters.nodes_deleted"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "def eliminar_relaciones(uri, auth, relationship_type):\n",
    "\n",
    "    query = \"\"\"\n",
    "    MATCH ()-[r:{relationship_type}]->()\n",
    "    DELETE r\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query)\n",
    "            return result.consume().counters.relationships_deleted"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "def agregar_propiedad(uri, auth, label, property_key, property_value):\n",
    "\n",
    "    query = f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    SET n.{property_key} = $property_value\n",
    "    RETURN COUNT(n) AS total_updated\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, property_value=property_value)\n",
    "            return result.single()[\"total_updated\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "def quitar_propiedad(uri, auth, label, property_key):\n",
    "\n",
    "    query = f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    REMOVE n.{property_key}\n",
    "    RETURN COUNT(n) AS total_updated\n",
    "    \"\"\"\n",
    "\n",
    "    with GraphDatabase.driver(uri, auth=auth) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query)\n",
    "            return result.single()[\"total_updated\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 62841 relaciones ACTED_IN con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "# Propiedades para ACTED_IN\n",
    "properties_keys = [\"ScreenTime\", \"CharacterImportance\"]\n",
    "relacion = \"ACTED_IN\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 62841 relaciones ACTED_IN con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 4669 relaciones DIRECTED con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#propiedades para DIRECTED\n",
    "properties_keys = [\"Year\", \"FilmFestival\"]\n",
    "relacion = \"DIRECTED\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 4669 relaciones DIRECTED_BY con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para directed by\n",
    "properties_keys = [\"Year\", \"FilmFestival\"]\n",
    "relacion = \"DIRECTED_BY\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 49350 relaciones FILMED_IN con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para FILMED_IN\n",
    "properties_keys = [\"City\", \"Days\", \"Year\"]\n",
    "relacion = \"FILMED_IN\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Prpiedades para Likes\n",
    "properties_keys = [\"\"]\n",
    "relacion = \"LIKES\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'crear_relaciones' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m/Users/sebastianfranco/Downloads/Proyecto1 (3).ipynb Celda 10\u001b[0m line \u001b[0;36m4\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/sebastianfranco/Downloads/Proyecto1%20%283%29.ipynb#X12sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m properties_keys \u001b[39m=\u001b[39m [\u001b[39m\"\u001b[39m\u001b[39mSince\u001b[39m\u001b[39m\"\u001b[39m, \u001b[39m\"\u001b[39m\u001b[39mCommonInterests\u001b[39m\u001b[39m\"\u001b[39m, \u001b[39m\"\u001b[39m\u001b[39mFrequenciaInteraccion\u001b[39m\u001b[39m\"\u001b[39m]\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/sebastianfranco/Downloads/Proyecto1%20%283%29.ipynb#X12sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m relacion \u001b[39m=\u001b[39m \u001b[39m\"\u001b[39m\u001b[39mFRIENDS_WITH\u001b[39m\u001b[39m\"\u001b[39m\n\u001b[0;32m----> <a href='vscode-notebook-cell:/Users/sebastianfranco/Downloads/Proyecto1%20%283%29.ipynb#X12sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m total \u001b[39m=\u001b[39m crear_relaciones(uri, auth, relacion, properties_keys)\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/sebastianfranco/Downloads/Proyecto1%20%283%29.ipynb#X12sZmlsZQ%3D%3D?line=4'>5</a>\u001b[0m \u001b[39mprint\u001b[39m(\u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mSe actualizaron \u001b[39m\u001b[39m{\u001b[39;00mtotal\u001b[39m}\u001b[39;00m\u001b[39m relaciones \u001b[39m\u001b[39m{\u001b[39;00mrelacion\u001b[39m}\u001b[39;00m\u001b[39m con nuevas propiedades vacías\u001b[39m\u001b[39m\"\u001b[39m)\n",
      "\u001b[0;31mNameError\u001b[0m: name 'crear_relaciones' is not defined"
     ]
    }
   ],
   "source": [
    "#Prpiedades para IS FRIENDS WITH\n",
    "properties_keys = [\"Since\", \"CommonInterests\", \"FrequenciaInteraccion\"]\n",
    "relacion = \"IS_FRIENDS_WITH\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 91015 relaciones IS_TYPE con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para IS TYPE\n",
    "properties_keys = [\"CommunityRating\", \"ReviewText\", \"MatchAccuracy\"]\n",
    "relacion = \"IS_TYPE\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 34853 relaciones OPERATES_IN con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para OPERATS IN\n",
    "properties_keys = [\"Marketshare\",  \"YearsEstablished\"]\n",
    "relacion = \"OPERATES_IN\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 68434 relaciones PRODUCED_BY con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para PRODUCED BY\n",
    "properties_keys = [\"Budget\", \"BoxOffice\", \"Reception\"]\n",
    "relacion = \"PRODUCED_BY\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 2514 relaciones RATED con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para RATED\n",
    "properties_keys = [ \"RatingDate\", \"ReviewText\"]\n",
    "relacion = \"RATED\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Se actualizaron 2514 relaciones WAS_RECOMMENDED_BY con nuevas propiedades vacías\n"
     ]
    }
   ],
   "source": [
    "#Prpiedades para RECOMMENDED_BY\n",
    "properties_keys = [\"Ratingvalue\", \"RatingDate\", \"ReviewText\"]\n",
    "relacion = \"WAS_RECOMMENDED_BY\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Prpiedades para RECOMMENDED_BY\n",
    "properties_keys = [\"Ratingvalue\", \"RatingDate\", \"ReviewText\"]\n",
    "relacion = \"WAS_RECOMMENDED_BY\"\n",
    "total = crear_relaciones(uri, auth, relacion, properties_keys)\n",
    "print(f\"Se actualizaron {total} relaciones {relacion} con nuevas propiedades vacías\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Recomendador"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=auth)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "#verificar que exista el usuario\n",
    "def user_exists(user_id):\n",
    "    \"\"\"\n",
    "    Retorna True si existe un nodo User con la propiedad user_id = user_id,\n",
    "    False en caso contrario.\n",
    "    \"\"\"\n",
    "    query = \"\"\"\n",
    "    MATCH (u:User {UserID: $user_id})\n",
    "    RETURN count(u) AS count\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, user_id=user_id)\n",
    "        record = result.single()\n",
    "        if record and record[\"count\"] > 0:\n",
    "            return True\n",
    "        return False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "def recommend_by_user(user_id, rating_threshold=3.5, top_n=10):\n",
    "    \"\"\"\n",
    "    Recomienda películas que el usuario no haya visto, pero que sus amigos\n",
    "    hayan valorado por encima de rating_threshold.\n",
    "    \"\"\"\n",
    "    # Primero, verificamos si el usuario existe\n",
    "    if not user_exists(user_id):\n",
    "        print(f\"Error: No se encontró ningún usuario con ID = {user_id}.\")\n",
    "        return []\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (u:User {UserID: $user_id})-[r:RATED]->(m:Movie)\n",
    "    WITH m, avg(r.Rating) AS user_avg_rating\n",
    "    WHERE user_avg_rating >= $rating_threshold\n",
    "    RETURN m.Title AS title, user_avg_rating\n",
    "    ORDER BY user_avg_rating DESC\n",
    "    LIMIT $top_n;\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\n",
    "            query,\n",
    "            user_id=user_id,\n",
    "            rating_threshold=rating_threshold,\n",
    "            top_n=top_n\n",
    "        )\n",
    "        return [record.data() for record in result]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def search_movies(\n",
    "    genre=None,\n",
    "    year=None,\n",
    "    duration=None,\n",
    "    keywords=None,\n",
    "    company=None,\n",
    "    director=None,\n",
    "    top_n=10\n",
    "):\n",
    "    \n",
    "    base_query = \"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    OPTIONAL MATCH (m)-[:IS_TYPE]->(g:Genre)\n",
    "    OPTIONAL MATCH (m)-[:PRODUCED_BY]->(c:Company)\n",
    "    OPTIONAL MATCH (m)<-[:DIRECTED]-(d:Director)\n",
    "    WHERE 1=1\n",
    "    \"\"\"\n",
    "    conditions = []\n",
    "    \n",
    "    if genre:\n",
    "        conditions.append(\"g.Name = $genre\")\n",
    "    \n",
    "    if year:\n",
    "        conditions.append(\"(date(m.Released).year >= $yearMin AND date(m.Released).year <= $yearMax)\")\n",
    "    \n",
    "    if duration:\n",
    "        conditions.append(\"(m.Runtime >= $durationMin AND m.Runtime <= $durationMax)\")\n",
    "    \n",
    "    if keywords:\n",
    "        conditions.append(\"m.Keyword CONTAINS $keywords\")\n",
    "    \n",
    "    if company:\n",
    "        conditions.append(\"c.Name CONTAINS $company\")\n",
    "    \n",
    "    if director:\n",
    "        conditions.append(\"d.Name CONTAINS $director\")\n",
    "    \n",
    "    if conditions:\n",
    "        base_query += \" OR \" + \" OR \".join(conditions)\n",
    "    \n",
    "    base_query += \"\"\"\n",
    "    RETURN DISTINCT m.Title AS title, \n",
    "        date(m.Released).year AS year, \n",
    "        m.Runtime AS duration\n",
    "    ORDER BY date(m.Released).year DESC, m.Runtime DESC, m.Title\n",
    "    LIMIT $top_n\n",
    "    \"\"\"\n",
    "    \n",
    "    params = {\n",
    "        \"genre\": genre,\n",
    "        \"keywords\": keywords,\n",
    "        \"company\": company,\n",
    "        \"director\": director,\n",
    "        \"top_n\": top_n,\n",
    "        \"yearMin\": year - 2 if year else None,\n",
    "        \"yearMax\": year + 2 if year else None,\n",
    "        \"durationMin\": duration - 30 if duration else None,\n",
    "        \"durationMax\": duration + 30 if duration else None\n",
    "    }\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        result = session.run(base_query, **params)\n",
    "        return [record.data() for record in result]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "\n",
    "def main():\n",
    "    print(\"Bienvenido al sistema de recomendación de películas.\")\n",
    "    print(\"1) Recomendación por usuario (basada en amigos).\")\n",
    "    print(\"2) Búsqueda personalizada (género, año ± 2, duración ± 30, palabras clave, compañía, director).\")\n",
    "    \n",
    "    opcion = input(\"Elige una opción (1/2): \").strip()\n",
    "    \n",
    "    if opcion == \"1\":\n",
    "        # Recomendación por usuario\n",
    "        user_id_str = input(\"Ingresa el ID del usuario: \").strip()\n",
    "        if not user_id_str.isdigit():\n",
    "            print(\"Error: El ID de usuario debe ser un número entero.\")\n",
    "            return\n",
    "        user_id = int(user_id_str)\n",
    "        \n",
    "        # Se recomienda con threshold de rating y top_n fijos, puedes modificar si quieres\n",
    "        recomendaciones = recommend_by_user(user_id, rating_threshold=3.5, top_n=10)\n",
    "        \n",
    "        if recomendaciones:\n",
    "            print(f\"\\n=== Recomendaciones para el usuario {user_id} (rating >= 3.5) ===\")\n",
    "            for rec in recomendaciones:\n",
    "                print(f\"{rec['title']} (Valoración promedio: {rec['user_avg_rating']:.2f})\")\n",
    "        else:\n",
    "            print(\"No se encontraron recomendaciones para este usuario o el usuario no existe.\")\n",
    "    \n",
    "    elif opcion == \"2\":\n",
    "        # Búsqueda personalizada\n",
    "        print(\"Puedes dejar cualquier campo en blanco para omitirlo.\")\n",
    "        \n",
    "        genre = input(\"Género: \").strip()\n",
    "        year_input = input(\"Año (± 2): \").strip()\n",
    "        duration_input = input(\"Duración aproximada (minutos ± 30): \").strip()\n",
    "        keywords = input(\"Palabras clave (en la columna 'Keywords'): \").strip()\n",
    "        company = input(\"Compañía/Estudio (búsqueda parcial): \").strip()\n",
    "        director = input(\"Director (búsqueda parcial): \").strip()\n",
    "        \n",
    "        # Validamos si year y duration son dígitos\n",
    "        year = None\n",
    "        if year_input:\n",
    "            if year_input.isdigit():\n",
    "                year = int(year_input)\n",
    "            else:\n",
    "                print(\"Aviso: El año ingresado no es un número. Se ignorará el filtro de año.\")\n",
    "        \n",
    "        duration = None\n",
    "        if duration_input:\n",
    "            if duration_input.isdigit():\n",
    "                duration = int(duration_input)\n",
    "            else:\n",
    "                print(\"Aviso: La duración ingresada no es un número. Se ignorará el filtro de duración.\")\n",
    "        \n",
    "        resultados = search_movies(\n",
    "            genre=genre if genre else None,\n",
    "            year=year,\n",
    "            duration=duration,\n",
    "            keywords=keywords if keywords else None,\n",
    "            company=company if company else None,\n",
    "            director=director if director else None,\n",
    "            top_n=10\n",
    "        )\n",
    "        \n",
    "        if resultados:\n",
    "            print(\"\\n=== Resultados de búsqueda ===\")\n",
    "            for r in resultados:\n",
    "                print(f\"{r['title']} (Año: {r['year']}, Duración: {r['duration']} min)\")\n",
    "        else:\n",
    "            print(\"No se encontraron películas que cumplan los criterios (o no existen en la BD).\")\n",
    "    \n",
    "    else:\n",
    "        print(\"Opción no válida.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bienvenido al sistema de recomendación de películas.\n",
      "1) Recomendación por usuario (basada en amigos).\n",
      "2) Búsqueda personalizada (género, año ± 2, duración ± 30, palabras clave, compañía, director).\n",
      "\n",
      "=== Recomendaciones para el usuario 2 (rating >= 3.5) ===\n",
      "Kicking Off (Valoración promedio: 4.80)\n",
      "Cose da pazzi (Valoración promedio: 4.78)\n",
      "Kite Liberator (Valoración promedio: 4.72)\n",
      "My Awkward Sexual Adventure (Valoración promedio: 4.68)\n",
      "Wittgenstein (Valoración promedio: 4.44)\n",
      "Who Saw Him Die? (Valoración promedio: 4.43)\n",
      "Fantozzi The Return (Valoración promedio: 4.38)\n",
      "Amen (Valoración promedio: 4.36)\n",
      "The Man Who Left His Will on Film (Valoración promedio: 4.31)\n",
      "Time Regained (Valoración promedio: 3.83)\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "    try:\n",
    "        driver = GraphDatabase.driver(uri, auth=auth)\n",
    "        main()\n",
    "    except Exception as e:\n",
    "        print(f\"Ocurrió un error inesperado: {e}\")\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"\\n# Conexión a Neo4j\\n\\ndriver = neo4j_connect(uri, auth)\\n\\n################### MAIN\\n\\nmenu()\\n\\n# Recoger inputs del usuario\\ninputs = variables_recomendacion()\\ngenero, released, duracion, keywords, studio, director, actors = inputs\\n\\n# Obtener recomendaciones\\nrecommendations = get_movie_recommendations(driver, *inputs)\\n\\n#Imprimir recomendaciones\\nfor movie in recommendations:\\n    print(movie['Title'], movie['Released'], movie['Runtime'])\\n############################################\\n\\n\""
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import datetime\n",
    "def menu():\n",
    "    print(\"BIENVENIDO AL RECOMENDADOR DE PELICULAS\")\n",
    "    print(\"Ingresa tus gustos y preferencias a continuación:\")\n",
    "\n",
    "\n",
    "def validar_fecha(fecha_texto):\n",
    "    try:\n",
    "        datetime.datetime.strptime(fecha_texto, \"%Y-%m-%d\")\n",
    "        return True\n",
    "    except ValueError:\n",
    "        return False\n",
    "\n",
    "def procesar_entrada_lista(entrada, capitalizar=False):\n",
    "    lista = entrada.split(',')\n",
    "    if capitalizar:\n",
    "        # Capitalizar la primera letra de cada palabra en cada elemento de la lista.\n",
    "        return [item.strip().title() for item in lista]\n",
    "    else:\n",
    "        return [item.strip() for item in lista]\n",
    "\n",
    "def variables_recomendacion():\n",
    "    genero = procesar_entrada_lista(input(\"Ingresa los géneros que te gustan, separados por comas: \"), True)\n",
    "    \n",
    "    while True:\n",
    "        released = input(\"Ingresa la fecha de estreno que prefieres (formato YYYY-MM-DD): \").strip()\n",
    "        if validar_fecha(released):\n",
    "            break\n",
    "        print(\"Formato de fecha incorrecto, por favor intenta de nuevo.\")\n",
    "    \n",
    "    while True:\n",
    "        duracion = input(\"Ingresa la duración mínima que prefieres para la película (en minutos): \").strip()\n",
    "        if duracion.isdigit():\n",
    "            duracion = int(duracion)\n",
    "            break\n",
    "        print(\"Por favor ingresa un número válido.\")\n",
    "    \n",
    "    keywords = procesar_entrada_lista(input(\"Ingresa palabras clave relacionadas con la película, separadas por comas: \"))\n",
    "    studio = input(\"Ingresa el estudio de cine que prefieres: \").strip().title()\n",
    "    director = input(\"Ingresa el nombre del director que te gustaría ver: \").strip().title()\n",
    "    actors = procesar_entrada_lista(input(\"Ingresa los nombres de los actores que te gustan, separados por comas: \"), True)\n",
    "\n",
    "    return genero, released, duracion, keywords, studio, director, actors\n",
    "\n",
    "\n",
    "#############################################\n",
    "\n",
    "def neo4j_connect(uri, auth):\n",
    "    driver = GraphDatabase.driver(uri, auth=auth)\n",
    "    return driver\n",
    "\n",
    "def get_movie_recommendations(driver, genero, released, duracion, keywords, studio, director, actors):\n",
    "    # Ajustar el rango de fecha\n",
    "    year = int(released.split(\"-\")[0])\n",
    "    min_year = year - 5\n",
    "    max_year = year + 5\n",
    "    \n",
    "    # Ajustar el rango de duración\n",
    "    min_runtime = duracion - 30\n",
    "    max_runtime = duracion + 30\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (m:Movie)<-[:ACTED_IN]-(a:Actor), \n",
    "        (m)-[:IS_TYPE]->(g:Genre), \n",
    "        (m)<-[:DIRECTED_BY]-(d:Director), \n",
    "        (m)<-[:PRODUCED_BY]-(c:Company)\n",
    "    WITH m, \n",
    "        collect(a.Name) AS actorNames,\n",
    "        count(DISTINCT g.Name) AS genreMatch,\n",
    "        CASE WHEN m.Released >= $minYear AND m.Released <= $maxYear THEN 1 ELSE 0 END AS yearMatch,\n",
    "        CASE WHEN m.Runtime >= $minRuntime AND m.Runtime <= $maxRuntime THEN 1 ELSE 0 END AS runtimeMatch,\n",
    "        CASE WHEN any(keyword IN m.Keyword WHERE keyword IN $keywords) THEN 1 ELSE 0 END AS keywordMatch,\n",
    "        CASE WHEN c.Name = $studio THEN 1 ELSE 0 END AS studioMatch,\n",
    "        CASE WHEN d.Name = $director THEN 1 ELSE 0 END AS directorMatch\n",
    "    WHERE any(actor IN $actors WHERE actor IN actorNames)\n",
    "    WITH m, \n",
    "        genreMatch + yearMatch + runtimeMatch + keywordMatch + studioMatch + directorMatch AS matchScore\n",
    "    WHERE matchScore >= 2  // Solo tomar películas que cumplan al menos 3 condiciones\n",
    "    RETURN m.Title AS Title, m.Released AS Released, m.Runtime AS Runtime, matchScore\n",
    "    ORDER BY matchScore DESC\n",
    "    LIMIT 10;\n",
    "\n",
    "    \"\"\"\n",
    "\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, {\n",
    "            'genres': genero,\n",
    "            'minYear': min_year,\n",
    "            'maxYear': max_year,\n",
    "            'minRuntime': min_runtime,\n",
    "            'maxRuntime': max_runtime,\n",
    "            'keywords': keywords,\n",
    "            'studio': studio,\n",
    "            'director': director,\n",
    "            'actors': actors\n",
    "        })\n",
    "        return list(result)\n",
    "\n",
    "\"\"\"\n",
    "# Conexión a Neo4j\n",
    "\n",
    "driver = neo4j_connect(uri, auth)\n",
    "\n",
    "################### MAIN\n",
    "\n",
    "menu()\n",
    "\n",
    "# Recoger inputs del usuario\n",
    "inputs = variables_recomendacion()\n",
    "genero, released, duracion, keywords, studio, director, actors = inputs\n",
    "\n",
    "# Obtener recomendaciones\n",
    "recommendations = get_movie_recommendations(driver, *inputs)\n",
    "\n",
    "#Imprimir recomendaciones\n",
    "for movie in recommendations:\n",
    "    print(movie['Title'], movie['Released'], movie['Runtime'])\n",
    "############################################\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bienvenido al sistema de recomendación de películas.\n",
      "1) Recomendación por usuario (basada en amigos).\n",
      "2) Búsqueda personalizada (género, año ± 2, duración ± 30, palabras clave, compañía, director).\n",
      "Puedes dejar cualquier campo en blanco para omitirlo.\n",
      "\n",
      "=== Resultados de búsqueda ===\n",
      "Allende en su laberinto (Año: None, Duración: None min)\n",
      "Aprel (Año: None, Duración: None min)\n",
      "Aurinkotuuli (Año: None, Duración: None min)\n",
      "Bad Dad Rehab (Año: None, Duración: None min)\n",
      "Dolpo Tulku - Heimkehr in den Himalaya (Año: None, Duración: None min)\n",
      "Normaal: Ik Kom Altied Weer Terug (Año: None, Duración: None min)\n",
      "Pajęczarki (Año: None, Duración: None min)\n",
      "Pölynimurikauppiaat (Año: None, Duración: None min)\n",
      "Supermassive Black Holes (Año: None, Duración: None min)\n",
      "Vous êtes très jolie, mademoiselle (Año: None, Duración: None min)\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "    try:\n",
    "        driver = GraphDatabase.driver(uri, auth=auth)\n",
    "        main()\n",
    "    except Exception as e:\n",
    "        print(f\"Ocurrió un error inesperado: {e}\")\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Conexión exitosa.\n",
      "BIENVENIDO AL RECOMENDADOR DE PELICULAS\n",
      "Ingresa tus gustos y preferencias a continuación:\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.AggregationSkippedNull} {category: UNRECOGNIZED} {title: The query contains an aggregation function that skips null values.} {description: null value eliminated in set function.} {position: None} for query: \"\\n    MATCH (m:Movie)\\n    OPTIONAL MATCH (m)-[:IS_TYPE]->(g:Genre)\\n    WITH m, COLLECT(g.Name) AS Genres\\n    OPTIONAL MATCH (m)<-[:DIRECTED_BY]-(d:Director)\\n    WITH m, Genres, COLLECT(d.Name) AS Directors\\n    OPTIONAL MATCH (m)<-[:PRODUCED_BY]-(c:Company)\\n    WITH m, Genres, Directors, COLLECT(c.Name) AS Companies\\n    OPTIONAL MATCH (m)<-[:ACTED_IN]-(a:Actor)\\n    WITH m, Genres, Directors, Companies, COLLECT(a.Name) AS Actors\\n    WITH m, Genres, Directors, Companies, Actors,\\n        ((CASE WHEN ANY(genre IN Genres WHERE genre IN $genres) THEN 1 ELSE 0 END) +\\n        (CASE WHEN $director IS NOT NULL AND ANY(director IN Directors WHERE director = $director) THEN 1 ELSE 0 END) +\\n        (CASE WHEN $studio IS NOT NULL AND ANY(company IN Companies WHERE company = $studio) THEN 1 ELSE 0 END) +\\n        (CASE WHEN ANY(actor IN Actors WHERE actor IN $actors) THEN 1 ELSE 0 END) +\\n        (CASE WHEN ANY(keyword IN split(m.Keyword, ',') WHERE keyword IN $keywords) THEN 1 ELSE 0 END)\\n        ) AS Score\\n    RETURN m AS Movie, Score, Genres, Directors, Companies, Actors\\n    ORDER BY Score DESC\\n    LIMIT 10\\n\\n    \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Title: The Break-Up\n",
      "Released: 2006-06-01T00:00:00.000000000+00:00\n",
      "Runtime: 106.0\n",
      "Genres: Comedy, Romance\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: \n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Rio\n",
      "Released: 2011-04-03T00:00:00.000000000+00:00\n",
      "Runtime: 96.0\n",
      "Genres: Animation, Comedy, Family, Adventure\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Leslie Mann, Jamie Foxx, Tracy Morgan, Jesse Eisenberg, Rodrigo Santoro, Carlos Ponce, Anne Hathaway, Wanda Sykes, George Lopez, Jake T. Austin, Jane Lynch, Will.i.am, Jemaine Clement\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Road House\n",
      "Released: 1948-09-22T00:00:00.000000000+00:00\n",
      "Runtime: 95.0\n",
      "Genres: Romance, Drama, Action, Thriller\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: \n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Hoodwinked!\n",
      "Released: 2005-12-16T00:00:00.000000000+00:00\n",
      "Runtime: 80.0\n",
      "Genres: Animation, Comedy, Family\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Glenn Close, David Ogden Stiers, Chazz Palminteri, Jim Belushi, Andy Dick, Patrick Warburton, Anthony Anderson, Tom Kenny, Anne Hathaway, Xzibit, Cory Edwards, Benjy Gaither, Ken Marino, Preston Stutzman, Tony Leech\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: The Devil Wears Prada\n",
      "Released: 2006-06-30T00:00:00.000000000+00:00\n",
      "Runtime: 109.0\n",
      "Genres: Comedy, Romance, Drama\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Stanley Tucci, Meryl Streep, Adrian Grenier, Simon Baker, David Marshall Grant, Emily Blunt, Tracie Thoms, Anne Hathaway, Rich Sommer, Daniel Sunjata, Rebecca Mader, Gisele Bündchen, Heidi Klum, Alyssa Sutherland, Ines Rivero, Stephanie Szostak, Ivanka Trump, Tibor Feldman\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Valentine's Day\n",
      "Released: 2010-02-10T00:00:00.000000000+00:00\n",
      "Runtime: 125.0\n",
      "Genres: Comedy, Romance\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Kathy Bates, Shirley MacLaine, Patrick Dempsey, Queen Latifah, Héctor Elizondo, Jamie Foxx, Julia Roberts, Emma Roberts, Jessica Biel, Ashton Kutcher, Topher Grace, Katherine LaNasa, Jessica Alba, Anne Hathaway, Taylor Lautner, Bradley Cooper, Carter Jenkins, Jennifer Garner, George Lopez, Joseph Leo Bwarie, Eric Dane, Taylor Swift, Derek Theler\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Sense and Sensibility\n",
      "Released: 1995-12-13T00:00:00.000000000+00:00\n",
      "Runtime: 136.0\n",
      "Genres: Romance, Drama\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: \n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Mystery Men\n",
      "Released: 1999-08-06T00:00:00.000000000+00:00\n",
      "Runtime: 121.0\n",
      "Genres: Comedy, Adventure, Fantasy, Action, Science Fiction\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Ben Stiller, Hank Azaria, Ernie Lee Banks, William H. Macy, Jenifer Lewis, Ned Bellamy, Wes Studi, Janeane Garofalo, Eddie Izzard, Tom Waits, Claire Forlani, Stacey Travis, Ricky Jay, Greg Kinnear, Geoffrey Rush, Kel Mitchell, Paul Reubens, Lena Olin, Artie Lange, Pras, Louise Lasser, Gerry Becker, Corbin Bleu, Philip Bolden, Emmy Laybourne, Michael Bay\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Havoc\n",
      "Released: 2005-10-16T00:00:00.000000000+00:00\n",
      "Runtime: 85.0\n",
      "Genres: Drama, Thriller\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Joseph Gordon-Levitt, Michael Biehn, Freddy Rodríguez, Raymond Cruz, Shiri Appleby, Mike Vogel, Channing Tatum, Bijou Phillips, Anne Hathaway, Alexis Dziena, Sam Bottoms, Laura Breckenridge\n",
      "Score: 2\n",
      "--------------------------------------------------\n",
      "Title: Interstellar\n",
      "Released: 2014-11-05T00:00:00.000000000+00:00\n",
      "Runtime: 169.0\n",
      "Genres: Adventure, Drama, Science Fiction\n",
      "Directors: \n",
      "Companies: \n",
      "Actors: Matthew McConaughey, Ellen Burstyn, John Lithgow, William Devane, Casey Affleck, Bill Irwin, Matt Damon, Michael Caine, Wes Bentley, Topher Grace, Anne Hathaway, David Oyelowo, Collette Wolfe, Josh Stewart, Timothée Chalamet, Brooke Smith, Jeff Hephner, Jessica Chastain, Elyes Gabel, Mackenzie Foy, David Gyasi, Leah Cairns, Russ Fega, Lena Georgas, Liam Dickinson, Francis X. McCarthy, Andrew Borba, Flora Nolan, William Patrick Brown, Cici Leah Campbell, Kristian Van der Heyden, Mark Casimir Dyniewicz, Joseph Oliveira, Ryan Irving, Alexander Michael Helisek, Benjamin Hardy\n",
      "Score: 2\n",
      "--------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "import datetime\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "def menu():\n",
    "    print(\"BIENVENIDO AL RECOMENDADOR DE PELICULAS\")\n",
    "    print(\"Ingresa tus gustos y preferencias a continuación:\")\n",
    "\n",
    "def validar_fecha(fecha_texto):\n",
    "    try:\n",
    "        datetime.datetime.strptime(fecha_texto, \"%Y-%m-%d\")\n",
    "        return True\n",
    "    except ValueError:\n",
    "        return False\n",
    "\n",
    "def procesar_entrada_lista(entrada, capitalizar=False):\n",
    "    lista = entrada.split(',')\n",
    "    if capitalizar:\n",
    "        return [item.strip().title() for item in lista]\n",
    "    else:\n",
    "        return [item.strip() for item in lista]\n",
    "\n",
    "def variables_recomendacion():\n",
    "    genero = procesar_entrada_lista(input(\"Ingresa los géneros que te gustan, separados por comas: \"), True)\n",
    "    while True:\n",
    "        released = input(\"Ingresa la fecha de estreno que prefieres (formato YYYY-MM-DD): \").strip()\n",
    "        if validar_fecha(released):\n",
    "            break\n",
    "        print(\"Formato de fecha incorrecto, por favor intenta de nuevo.\")\n",
    "    while True:\n",
    "        duracion = input(\"Ingresa la duración mínima que prefieres para la película (en minutos): \").strip()\n",
    "        if duracion.isdigit():\n",
    "            duracion = int(duracion)\n",
    "            break\n",
    "        print(\"Por favor ingresa un número válido.\")\n",
    "    keywords = procesar_entrada_lista(input(\"Ingresa palabras clave relacionadas con la película, separadas por comas: \"))\n",
    "    studio = input(\"Ingresa el estudio de cine que prefieres: \").strip().title()\n",
    "    director = input(\"Ingresa el nombre del director que te gustaría ver: \").strip().title()\n",
    "    actors = procesar_entrada_lista(input(\"Ingresa los nombres de los actores que te gustan, separados por comas: \"), True)\n",
    "    return genero, released, duracion, keywords, studio, director, actors\n",
    "\n",
    "def neo4j_connect(uri, user, password):\n",
    "    driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "    return driver\n",
    "\n",
    "uri = \"neo4j+ssc://4d9cb826.databases.neo4j.io\"\n",
    "user, password = (\"neo4j\", \"_4X58M73ITpFpJVDUxHA2K1Bu92nWAUvuvpz4NzsFLU\")\n",
    "driver = neo4j_connect(uri, user, password)\n",
    "\n",
    "try:\n",
    "    driver.verify_connectivity()\n",
    "    print(\"Conexión exitosa.\")\n",
    "except Exception as e:\n",
    "    print(f\"Error al conectar: {e}\")\n",
    "\n",
    "def get_movie_recommendations(driver, genero, released, duracion, keywords, studio, director, actors):\n",
    "    # Convertir la fecha ingresada al año y crear rangos de años\n",
    "    year = datetime.datetime.strptime(released, \"%Y-%m-%d\").year\n",
    "    min_year = f\"{year-10}-01-01\"\n",
    "    max_year = f\"{year+10}-12-31\"\n",
    "    \n",
    "    # Ajustar el rango de duración\n",
    "    min_runtime = duracion - 30\n",
    "    max_runtime = duracion + 30\n",
    "    \n",
    "    # Preparar la consulta Cypher\n",
    "    query = \"\"\"\n",
    "    MATCH (m:Movie)\n",
    "    OPTIONAL MATCH (m)-[:IS_TYPE]->(g:Genre)\n",
    "    WITH m, COLLECT(g.Name) AS Genres\n",
    "    OPTIONAL MATCH (m)<-[:DIRECTED_BY]-(d:Director)\n",
    "    WITH m, Genres, COLLECT(d.Name) AS Directors\n",
    "    OPTIONAL MATCH (m)<-[:PRODUCED_BY]-(c:Company)\n",
    "    WITH m, Genres, Directors, COLLECT(c.Name) AS Companies\n",
    "    OPTIONAL MATCH (m)<-[:ACTED_IN]-(a:Actor)\n",
    "    WITH m, Genres, Directors, Companies, COLLECT(a.Name) AS Actors\n",
    "    WITH m, Genres, Directors, Companies, Actors,\n",
    "        ((CASE WHEN ANY(genre IN Genres WHERE genre IN $genres) THEN 1 ELSE 0 END) +\n",
    "        (CASE WHEN $director IS NOT NULL AND ANY(director IN Directors WHERE director = $director) THEN 1 ELSE 0 END) +\n",
    "        (CASE WHEN $studio IS NOT NULL AND ANY(company IN Companies WHERE company = $studio) THEN 1 ELSE 0 END) +\n",
    "        (CASE WHEN ANY(actor IN Actors WHERE actor IN $actors) THEN 1 ELSE 0 END) +\n",
    "        (CASE WHEN ANY(keyword IN split(m.Keyword, ',') WHERE keyword IN $keywords) THEN 1 ELSE 0 END)\n",
    "        ) AS Score\n",
    "    RETURN m AS Movie, Score, Genres, Directors, Companies, Actors\n",
    "    ORDER BY Score DESC\n",
    "    LIMIT 10\n",
    "\n",
    "    \"\"\"\n",
    "    \n",
    "    # Ejecutar la consulta\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, {\n",
    "            'minYear': min_year,\n",
    "            'maxYear': max_year,\n",
    "            'minRuntime': min_runtime,\n",
    "            'maxRuntime': max_runtime,\n",
    "            'genres': genero,\n",
    "            'keywords': keywords,\n",
    "            'studio': studio,\n",
    "            'director': director,\n",
    "            'actors': actors\n",
    "        })\n",
    "        return list(result)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "menu()\n",
    "inputs = variables_recomendacion()\n",
    "genero, released, duracion, keywords, studio, director, actors = inputs\n",
    "recommendations = get_movie_recommendations(driver, *inputs)\n",
    "\n",
    "for movie in recommendations:\n",
    "    movie_info = movie['Movie']\n",
    "    genres = ', '.join(movie['Genres'])  # 'Genres' es una lista de nombres de géneros\n",
    "    directors = ', '.join(movie['Directors'])  # Similar para 'Directors'\n",
    "    companies = ', '.join(movie['Companies'])  # Y 'Companies'\n",
    "    actors = ', '.join(movie['Actors'])  # Y 'Actors'\n",
    "    score = movie['Score']  # Acceder al puntaje calculado\n",
    "\n",
    "\n",
    "    print(f\"Title: {movie_info['Title']}\")\n",
    "    print(f\"Released: {movie_info['Released']}\")\n",
    "    print(f\"Runtime: {movie_info['Runtime']}\")\n",
    "    print(f\"Genres: {genres}\")\n",
    "    print(f\"Directors: {directors}\")\n",
    "    print(f\"Companies: {companies}\")\n",
    "    print(f\"Actors: {actors}\")\n",
    "    print(f\"Score: {score}\")  # Imprimir el puntaje de coincidencia\n",
    "    print(\"--------------------------------------------------\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Bienvenido al sistema de recomendación de películas.\n",
      "1) Recomendación por usuario (basada en amigos).\n",
      "2) Búsqueda personalizada (género, año ± 2, duración ± 30, palabras clave, compañía, director).\n",
      "Opción no válida.\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "    try:\n",
    "        driver = GraphDatabase.driver(uri, auth=auth)\n",
    "        main()\n",
    "    except Exception as e:\n",
    "        print(f\"Ocurrió un error inesperado: {e}\")\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
